R6bandito/stm32_Cus_Flashdriver/Cus_Flash.c
	static const uint8_t gsc_secTotalCount = (sizeof(SectorTable) / sizeof(SectorTable[0]));

#endif /* (FLASH_TYPEERASE_SECTORS) && (DEVICE_STM32F4xx) */

/* PVD Flag. */
static volatile uint8_t gs_lowVoltage;

/* ****************************************************** */

static inline void 
__enter_critical( void )
{
	#if (CUS_FLASH_USE_SYS)
		CUS_FLASH_ENTER_CRITICAL();
	#else 
		__nop();
	#endif /* CUS_FLASH_USE_SYS */
}



static inline void 
__exit_critical( void )
{
	#if (CUS_FLASH_USE_SYS)
		CUS_FLASH_EXIT_CRITICAL();
	#else 
		__nop();
	#endif /* CUS_FLASH_USE_SYS */
}



static inline bool 
__sys_takeSemaphore( void )
{
	#if (CUS_FLASH_USE_SYS)
		bool isLock = Cus_Flash_SYS_Lock();
		return isLock;
	#else 
		return true;
	#endif /* CUS_FLASH_USE_SYS */
}



static inline void 
__sys_giveSemaphore( void )
{
	#if (CUS_FLASH_USE_SYS)
		Cus_Flash_SYS_Unlock();
	#else 
		__nop();
	#endif /* CUS_FLASH_USE_SYS */
}



void 
Cus_Flash_Lock( void )
{
	uint32_t FLASH_CR_RegTemp = FLASH->CR;

	if ( (FLASH_CR_RegTemp & FLASH_CR_LOCK_Msk) != 0 )    return;   /* Has already be locked. Return. */

	uint32_t timeout = Cus_Flash_GetSpinCount(100);
	while( (FLASH->SR & FLASH_SR_BSY_Msk) && --timeout )
	{
		__nop();
	}
	if ( !timeout )
	{
		/* Timeout waiting for Flash BSY bit to clear. Bus is still busy. */
		Cus_FLASH_LockFailed_Hook();
		return;
	}

	/* FLASH_CR Lock bit set. */
	FLASH->CR |= FLASH_CR_LOCK_Msk;

	FLASH_CR_RegTemp = FLASH->CR;
	if ( !(FLASH_CR_RegTemp & FLASH_CR_LOCK_Msk) )
	{
		/* Lock failed! FLASH_CR Lock bit still reset.(write/read-back dismatch!) */
		Cus_FLASH_LockFailed_Hook();
	}
}



void 
Cus_Flash_Unlock( void )
{
	uint32_t FLASH_CR_RegTemp = FLASH->CR;

	if ( (FLASH_CR_RegTemp & FLASH_CR_LOCK_Msk) == 0 )  return;   /* Has already be unlocked. Return. */

	uint32_t timeout = Cus_Flash_GetSpinCount(100);
	while( (FLASH->SR & FLASH_SR_BSY_Msk) && --timeout )
	{
		__nop();
	}
	if ( !timeout )
	{
		/* Timeout waiting for Flash BSY bit to clear. Bus is still busy. */
		Cus_FLASH_UnlockFailed_Hook();
		return;
	}

	/* Start Flash unlock sequence by writing KEY1 to FLASH_KEYR. */ 
	__enter_critical();
	FLASH->KEYR = FLASH_KEYR_KEY1;    
	__DSB();

	/* Writing the last KEY Code(KEY2) to FLASH_KEYR. */
	FLASH->KEYR = FLASH_KEYR_KEY2;    
	__exit_critical();

	FLASH_CR_RegTemp = FLASH->CR;
	if ( (FLASH_CR_RegTemp & FLASH_CR_LOCK_Msk) )   
	{
		/* Unlock failed! FLASH_CR Lock bit still set. (write/read-back dismatch!) */
		Cus_FLASH_UnlockFailed_Hook();
	}
}



bool 
Cus_Flash_CalibrateLatency( void )
{
	SystemCoreClockUpdate();
	uint32_t desire_Latancy = ((FLASH->ACR) & 0x07UL);

	#if (DEVICE_STM32F1xx)
		if ( (SystemCoreClock > 0) && (SystemCoreClock <= SYSTEMCLOCK_24Mhz) )
		{
			if ( desire_Latancy == 0x00 )   return true;
			else  desire_Latancy = 0x00;
		}
		else if ( (SystemCoreClock > SYSTEMCLOCK_24Mhz) && (SystemCoreClock <= SYSTEMCLOCK_48Mhz) )
		{
			if ( desire_Latancy == 0x01 )   return true;
			else desire_Latancy = 0x01;
		}
		else if ( (SystemCoreClock > SYSTEMCLOCK_48Mhz) && (SystemCoreClock <= SYSTEMCLOCK_72Mhz) )
		{
			if ( desire_Latancy == ((0x01UL) << 1) )  return true;
			else desire_Latancy = ((0x01UL) << 1);
		}
		else 
		{
			return false;               // 时钟错误. 不在范围内.
		}
	#endif // DEVICE_STM32F1xx

	#if (DEVICE_STM32F4xx)
		if ( (SystemCoreClock > 0) && (SystemCoreClock <= SYSTEMCLOCK_30Mhz) )
		{
			if ( desire_Latancy == 0x00 )   return true;
			else desire_Latancy = 0x00;
		}
		else if ( (SystemCoreClock > SYSTEMCLOCK_30Mhz) && (SystemCoreClock <= SYSTEMCLOCK_60Mhz) )
		{
			if ( desire_Latancy == 0x01 )   return true;
			else desire_Latancy = 0x01;
		}
		else if ( (SystemCoreClock > SYSTEMCLOCK_60Mhz) && (SystemCoreClock <= SYSTEMCLOCK_90Mhz) )
		{
			if ( desire_Latancy == ((0x01UL) << 1) )  return true;
			else desire_Latancy = ((0x01UL) << 1);
		}
		else if ( (SystemCoreClock > SYSTEMCLOCK_90Mhz) && (SystemCoreClock <= SYSTEMCLOCK_120Mhz) )
		{
			if ( desire_Latancy == ((0x01UL) << 1) | 0x01UL )  return true;
			else desire_Latancy = ((0x01UL) << 1) | 0x01UL;
		}
		else if ( (SystemCoreClock > SYSTEMCLOCK_120Mhz) && (SystemCoreClock <= SYSTEMCLOCK_150Mhz) )
		{
			if ( desire_Latancy == ((0x01UL) << 2) )  return true;
			else desire_Latancy = ((0x01UL) << 2);
		}
		else if ( (SystemCoreClock > SYSTEMCLOCK_150Mhz) && (SystemCoreClock <= SYSTEMCLOCK_168Mhz) )
		{
			if ( desire_Latancy == ((0x01UL) << 2) | 0x01UL )  return true;
			else desire_Latancy = ((0x01UL) << 2) | 0x01UL;
		}
		else 
		{
			return false;       // 时钟错误. 不在范围内.
		}
	#endif // DEVICE_STM32F4xx

	FLASH->ACR = (FLASH->ACR & ~0x07UL) | desire_Latancy;

	return ((FLASH->ACR & 0x07UL) == desire_Latancy);
}



/**
 * @brief 根据系统时钟计算自旋等待的循环次数（粗略估算）
 * @param ms 超时毫秒数
 * @return 循环次数（每个循环约 5~6 个指令周期）
 */
static uint32_t 
Cus_Flash_GetSpinCount( uint32_t ms )
{
	// 估算每个循环消耗的 CPU 周期数.
	const uint32_t cycles_per_loop = 5;

	uint32_t sysclk = SystemCoreClock;

	uint32_t total_cycles = (ms * sysclk) / 1000;

	return total_cycles / cycles_per_loop;
}



static Cus_Flash_State_t 
Cus_Flash_WaitBusy( uint32_t timeout_ms )
{
	uint32_t timeout = Cus_Flash_GetSpinCount(timeout_ms);
	while( (FLASH->SR & FLASH_SR_BSY_Msk) && --timeout ) { __nop(); }

	#if (DEVICE_STM32F4xx)
		static const uint32_t errorMask = FLASH_SR_PGAERR_Msk | FLASH_SR_PGPERR_Msk | FLASH_SR_PGSERR_Msk | FLASH_SR_WRPERR_Msk;
	#else
		static const uint32_t errorMask = FLASH_SR_PGERR_Msk | FLASH_SR_WRPRTERR_Msk;
	#endif /* DEVICE_STM32F4xx */

	if ( FLASH->SR & FLASH_SR_BSY_Msk ) return CUS_FLASH_TIMEOUT;

	if ( FLASH->SR & errorMask ) 
	{
		/* Clear error flag and return. */
		FLASH->SR |= errorMask;
		return CUS_FLASH_ERROR;
	}

	return CUS_FLASH_OK;
}



Cus_Flash_State_t 
Cus_Flash_WriteBuffer( uint32_t StartAddress, uint8_t *pData, uint32_t Buffer_Size )
{
	/* Check if the parameter is valid. */
	if ( StartAddress < FLASH_BASE || StartAddress > FLASH_END_ADDR || !pData || Buffer_Size == 0 )   
		return CUS_FLASH_PARAMETER;

	if ( (StartAddress & 0x01UL) )   
	{
		/* The Addr must aligned to half-word. */
		return CUS_FLASH_ALIGNED_ERR;
	}

