R6bandito/stm32_Cus_Flashdriver/Cus_Flash.c
	/* Check if the area is writable. */
	if ( !Cus_Flash_IsValid(StartAddress, Buffer_Size) )
		return CUS_FLASH_NOT_ERASED;

	Cus_Flash_State_t hReturn =  Cus_Flash_WaitBusy(50);
	if ( hReturn != CUS_FLASH_OK )
	{
		/* The BUS is still busy. Return. */
		return hReturn;
	}

	/* Low voltage state not recovered. Erase operation not allowed. */
	if ( gs_lowVoltage )
		return CUS_FLASH_LOW_VOLTAGE_ERR;

	/* Take Semaphore.(If in RTOS environment.) */
	bool isTake = __sys_takeSemaphore();
	if ( !isTake )
	{
		/* Failed to acquire mutex. Return. */
		return CUS_FLASH_MUTEX_ERR;
	}

	Cus_Flash_Unlock();

	/* Set FLASH_CR PG Bit. */
	FLASH->CR |= FLASH_CR_PG_Msk;

	#if (DEVICE_STM32F4xx)
		/* If the Device is F4 serial. Set FLASH_CR PSIZE Bits. (x16) */
		FLASH->CR = ((FLASH->CR & ~FLASH_CR_PSIZE_Msk) | (0x01UL << FLASH_CR_PSIZE_Pos));
	#endif /* DEVICE_STM32F4xx */

	/* hWordCount is always rounded up to an even number.  */
	uint32_t hWordCount = ((Buffer_Size + 1) / 2);

	volatile uint16_t *flash = (volatile uint16_t *)StartAddress;
	for( uint32_t index = 0; index < hWordCount; index++ )
	{
		uint16_t hw;
		if ( (index == hWordCount - 1) && ((Buffer_Size & 0x01UL) != 0) )
		{
			/* Size is odd. Handle the last half-word separately. */
			hw = pData[index * 2] | 0xFF00UL;
		}
		else 
		{
			/* Normal half-word case. */
			hw = ((uint16_t)pData[index * 2] | ((uint16_t)pData[index * 2 + 1] << 8));
		}

		*flash++ = hw;
		hReturn = Cus_Flash_WaitBusy(50);
		if ( hReturn != CUS_FLASH_OK )
		{
			/* Reset FLASH_CR. Return. */
			FLASH->CR &= ~(0x01UL << FLASH_CR_PG_Pos);
			__sys_giveSemaphore();
			Cus_Flash_Lock();
			return hReturn;
		}
	}

	if ( !Cus_Flash_VerifyBuffer(StartAddress, pData, Buffer_Size) )
	{
		/* Verify error. Inform upper layer and return. */
		FLASH->CR &= ~(0x01UL << FLASH_CR_PG_Pos);
		__sys_giveSemaphore();
		Cus_Flash_Lock();
		Cus_FLASH_VerifyBufferFailed_Hook(StartAddress, pData, Buffer_Size);
		return CUS_FLASH_VERIFY_ERR;
	}

	FLASH->CR &= ~(0x01UL << FLASH_CR_PG_Pos);
	Cus_Flash_Lock();
	__sys_giveSemaphore();
	return CUS_FLASH_OK;
}



bool 
Cus_Flash_VerifyBuffer( uint32_t StartAddress, uint8_t *pData, uint32_t Size )
{
	/* Check if the parameter is valid. */
	if ( StartAddress < FLASH_BASE || StartAddress > FLASH_END_ADDR || !pData || Size == 0 )  
		return false;

	if ( !(StartAddress & 0x03UL) && !(Size % 4) && !((uint32_t)pData & 0x03UL) )
	{
		/*  4-byte aligned. Use word access for faster verification. */
		uint32_t *flash = (uint32_t *)StartAddress;
		uint32_t *pSrc = (uint32_t *)pData;
		for( uint32_t index = 0; index < (Size / 4); index++ )
		{
			if ( *flash++ != *pSrc++ )
			{
				/* Verification failed. Word mismatch detected. */
				Cus_FLASH_VerifyBufferFailed_Hook(StartAddress, pData, Size);
				return false;
			}
		}
	}
	else 
	{
		/* Not 4-byte aligned. Fall back to byte-by-byte verification.  */
		for( uint32_t i = 0; i < Size; i++ )
		{
			if ( *((uint8_t *)StartAddress + i) != pData[i] )   
			{
				/* Verification failed. Byte mismatch detected. */
				Cus_FLASH_VerifyBufferFailed_Hook(StartAddress, pData, Size);
				return false;
			}
		}
	}

	return true;
}



bool 
Cus_Flash_IsValid( uint32_t StartAddress, uint32_t Size )
{
	if ( StartAddress < FLASH_BASE || StartAddress > FLASH_END_ADDR || Size == 0 )  
		return false;

	if ( !(StartAddress & 0x03UL) && !(Size % 4) )
	{
		/* 4-byte aligned. Use x32 for faster action. */
		uint32_t *flash = (uint32_t *)StartAddress;
		for( uint32_t index = 0; index < (Size / 4); index++ )
		{
			if ( *flash++ != UINT32_MAX )
			{
				/* Area is not all 0xFF (not erased). May contain existing data. Mark as unavailable and return. */
				return false;
			}
		}
	}
	else 
	{
		/* Not 4-byte aligned. Fall back to byte-by-byte verification. */
		for( uint32_t i = 0; i < Size; i++ )
		{
			if ( *((uint8_t *)StartAddress + i) != UINT8_MAX )   
			{
				return false;
			}
		}
	}

	return true;
}



Cus_Flash_State_t 
Cus_Flash_PVDConfig( Cus_Flash_PVD_t PVDLevel )
{
	/* Check if the PVDLEvel valid. */
	if ( PVDLevel > CUS_FLASH_PVD_LEVEL7 )
		return CUS_FLASH_PARAMETER;

	/* Set PWR_CR PLS Bits. */
	PWR->CR |= (PVDLevel << PWR_CR_PLS_Pos);

	/* Enable PVD NVIC and set priority. */
	NVIC_EnableIRQ(PVD_IRQn);
	NVIC_SetPriority(PVD_IRQn, 0);
}



void 
Cus_Flash_PVDSet( void )
{
	/* If PVD is enabled, place this API in the PVD ISR. */
	gs_lowVoltage = 1;
}



void 
Cus_Flash_PVDClr( void )
{
	/* Clear the PVD low voltage flag. */
	gs_lowVoltage = 0;
}



#if defined(FLASH_TYPEERASE_PAGES) && (DEVICE_STM32F1xx)

	Cus_Flash_State_t 
	Cus_Flash_ErasePage( uint32_t PageAddress )
	{
		/* Check if the parameter is valid. */
		if ( (PageAddress < FLASH_BASE) || (PageAddress >= FLASH_END_ADDR) )  
			return CUS_FLASH_PARAMETER;

		/* Check if the address is page-aligned. */
		if ( (PageAddress % CUS_FLASH_BYTE_PER_PAGE) )   
			return CUS_FLASH_PARAMETER;     

		/* Prevent Low-Voltage operation. */
		if ( gs_lowVoltage )
			return CUS_FLASH_LOW_VOLTAGE_ERR;

		Cus_Flash_State_t hReturn = Cus_Flash_WaitBusy(50);
		if ( hReturn != CUS_FLASH_OK )
		{
			/* BUS still busy. Return. */
			return hReturn;
		}

		/* Take Semaphore.(If in RTOS environment.) */
		bool isTake = __sys_takeSemaphore();
		if ( !isTake )
		{
			/* Accquire error. */
			return CUS_FLASH_MUTEX_ERR;
		}

		Cus_Flash_Unlock();

		__enter_critical();
		/* Set FLASH_CR PER Bit. */
		FLASH->CR |= FLASH_CR_PER_Msk;

		/* Set the page that will be erased in FLASH_AR. */
		FLASH->AR = PageAddress;

		/* Start erasing. (Set FLASH_CR STRT Bit) */
		FLASH->CR |= FLASH_CR_STRT_Msk;
		__exit_critical();

		hReturn = Cus_Flash_WaitBusy(FLASH_ERASE_TIMEOUT_MS);
		if ( hReturn != CUS_FLASH_OK )
		{
			__sys_giveSemaphore();
			Cus_FLASH_EraseFailed_Hook();
			Cus_Flash_Lock();
			return hReturn;
		}

		/* Clear PER Bit. */
		FLASH->CR &= ~FLASH_CR_PER_Msk;

		/* Normal back. */
		__sys_giveSemaphore();
		Cus_Flash_Lock();
		return CUS_FLASH_OK;
	}



	uint32_t 
	Cus_Flash_GetPageAddress( uint32_t page_index )
	{
		/* Check if the page_index valid. */
		if ( (FLASH_BASE + page_index * CUS_FLASH_BYTE_PER_PAGE) >= FLASH_END_ADDR )   
			return 0;

		return (uint32_t)(FLASH_BASE + ( page_index * CUS_FLASH_BYTE_PER_PAGE ));
	}



	uint32_t 
	Cus_Flash_GetPageStart( uint32_t Address )
	{
		if ( Address < FLASH_BASE || Address > FLASH_END_ADDR )   
			return 0;
		
		if ( (Address % CUS_FLASH_BYTE_PER_PAGE) == 0 )  
		{
			/* Already a page start address. Return */
			return Address;  
		} 

		return Cus_Flash_GetPageAddress( ((Address - FLASH_BASE) / CUS_FLASH_BYTE_PER_PAGE) );
	}



