R6bandito/stm32_Cus_Flashdriver/Cus_Flash.c
	Cus_Flash_State_t 
	Cus_Flash_WritePage( Cus_Flash_PageReq_t *pPage )
	{
		/* Check if the parameter valid. */
		if ( !pPage || pPage->PageStartAddress < FLASH_BASE || pPage->PageStartAddress >= FLASH_END_ADDR )
			return CUS_FLASH_PARAMETER;

		if ( !pPage->pBuffer || !(pPage->bufSize) )
			return CUS_FLASH_PARAMETER;

		/* Cross-page writes are not allowed. */
		if ( (pPage->Offset + pPage->bufSize) >= CUS_FLASH_BYTE_PER_PAGE )
			return CUS_FLASH_NOSPACE_ERR;

		/* Prevant Low-Voltage operation. */
		if ( gs_lowVoltage )
			return CUS_FLASH_LOW_VOLTAGE_ERR;

		Cus_Flash_State_t hReturn = Cus_Flash_WriteBuffer((pPage->PageStartAddress + pPage->Offset), pPage->pBuffer, pPage->bufSize);
		if ( hReturn != CUS_FLASH_OK )
		{
			/* Write error. */
			return hReturn;
		}

		return CUS_FLASH_OK;
	}



	Cus_Flash_State_t 
	Cus_Flash_ReadPage( Cus_Flash_PageReq_t *pPage )
	{
		if ( !pPage || !pPage->pBuffer || !pPage->bufSize )
			return CUS_FLASH_PARAMETER;

		if ( pPage->PageStartAddress < FLASH_BASE || pPage->PageStartAddress > FLASH_END_ADDR )
			return CUS_FLASH_PARAMETER;

		/* Read must be within a single page. Cross-page reads are not supported. */
		if ( (pPage->Offset + pPage->bufSize) > CUS_FLASH_BYTE_PER_PAGE )
			return CUS_FLASH_PARAMETER;

		if ( !((pPage->PageStartAddress + pPage->Offset) & 0x03UL) && !((uint32_t)pPage->pBuffer & 0x03UL) && !(pPage->bufSize & 0x03UL) )
		{
			/* Aligned to 4-Bytes. Use x32 for faster. */
			uint32_t *pRecv = (uint32_t *)pPage->pBuffer;
			uint32_t *flash = (uint32_t *)(pPage->PageStartAddress + pPage->Offset);
			for( uint32_t index = 0; index < (pPage->bufSize / 4); index++ )
			{
				*pRecv++ = *flash++;
			}
		}
		else 
		{
			for( uint32_t index = 0; index < pPage->bufSize; index++ )
			{
				pPage->pBuffer[index] = ((uint8_t *)(pPage->PageStartAddress + pPage->Offset))[index];
			}
		}

		if ( !Cus_Flash_VerifyBuffer((pPage->PageStartAddress + pPage->Offset), pPage->pBuffer, pPage->bufSize) )
		{
			/* Read verification failed. Notify upper layer and return. */
			Cus_FLASH_VerifyBufferFailed_Hook((pPage->PageStartAddress + pPage->Offset), pPage->pBuffer, pPage->bufSize);
			return CUS_FLASH_VERIFY_ERR;
		}

		return CUS_FLASH_OK;
	}



	int16_t 
	Cus_Flash_GetPageIndex( uint32_t Address )
	{
		if ( Address < FLASH_BASE || Address > FLASH_END_ADDR )   
			return -1;

		return (int16_t)((Address - FLASH_BASE) / CUS_FLASH_BYTE_PER_PAGE);
	}



	int16_t 
	Cus_Flash_GetTotalPages( void )
	{
		return (int16_t)( (FLASH_END_ADDR - FLASH_BASE) / CUS_FLASH_BYTE_PER_PAGE );
	}



	int32_t 
	Cus_Flash_GetRemainPages( uint32_t PageAddress )
	{
		if ( PageAddress < FLASH_BASE || PageAddress > FLASH_END_ADDR )   
			return -1;
		
		/* The address must be page-aligned. */
		if ( (PageAddress % CUS_FLASH_BYTE_PER_PAGE) )
			return -1;

		return (int32_t)( (FLASH_END_ADDR - PageAddress) / CUS_FLASH_BYTE_PER_PAGE );
	}



	int16_t 
	Cus_Flash_ErasePages( uint32_t PageStartAddress, uint16_t PageCount )
	{
		if ( PageStartAddress < FLASH_BASE || PageStartAddress > FLASH_END_ADDR )   
			return -1;

		/* PageStartAddress must be page-aligned. */
		if ( (PageStartAddress % CUS_FLASH_BYTE_PER_PAGE) )
			return -2;

		/* Get remain pages. */
		uint16_t PagesRemain = Cus_Flash_GetRemainPages(PageStartAddress);
		uint16_t PagesWaitToBeErase = PageCount;

		/* Requested page count exceeds remaining pages. Return. */
		if ( PagesWaitToBeErase > PagesRemain )   
			return -3;

		int16_t CurrectPage = Cus_Flash_GetPageIndex(PageStartAddress);
		uint16_t SuccessFulEraseCount = 0;

		for( uint16_t i = 0; i < PagesWaitToBeErase; i++ )
		{
			if ( Cus_Flash_ErasePage(Cus_Flash_GetPageAddress((uint32_t)CurrectPage + i)) != CUS_FLASH_OK )
			{
				/* Erase error occurred during batch. Return the number of pages successfully erased. */
				return SuccessFulEraseCount;
			}
			SuccessFulEraseCount++;
		}

		return PageCount;
	}

#endif // FLASH_TYPEERASE_PAGES



#if defined(FLASH_TYPEERASE_SECTORS) && (DEVICE_STM32F4xx)

	const Cus_Flash_Sector_t *
	Cus_Flash_GetSectorbyAddr( uint32_t Addr )
	{
		if ( (Addr < FLASH_BASE) || (Addr >= FLASH_END_ADDR) )	return NULL;

		for( uint8_t index = 0; index < gsc_secTotalCount; index++ )
		{
			uint32_t end_addr = SectorTable[index].secStartAddr + SectorTable[index].secSize;
			uint32_t start_addr = SectorTable[index].secStartAddr;
			if ( (Addr >= start_addr) && (Addr < end_addr) )
			{
				/* Find relevant sector. */
				return (const Cus_Flash_Sector_t *)&SectorTable[index];
			}
		}

		return NULL;
	}



	const Cus_Flash_Sector_t *
	Cus_Flash_GetSectorbyIndex( uint8_t Index )
	{
		if ( Index >= gsc_secTotalCount )	return NULL;

		return (const Cus_Flash_Sector_t *)&SectorTable[Index];
	}



	uint8_t 
	Cus_Flash_GetTotalSectors( void )
	{
		return gsc_secTotalCount;
	}



	uint32_t 
	Cus_Flash_GetSectorSize( uint8_t Index )
	{
		if ( Index >= gsc_secTotalCount )	return 0;

		return SectorTable[Index].secSize;
	}



	uint8_t 
	Cus_Flash_GetRemainSectors( uint8_t Index )
	{
		if ( Index >= gsc_secTotalCount )	return 0;

		return ((gsc_secTotalCount - 1) - Index);
	}



	void 
	Cus_Flash_EnableART( void )
	{
		uint32_t acrReg = FLASH->ACR;
		uint32_t currentHCLK = SystemCoreClock;
		if ( (currentHCLK > SYSTEMCLOCK_60Mhz) && ((acrReg & FLASH_ACR_LATENCY_Msk) < 2) )
		{
			/* Wrong ACR LATENCY Config.Refuse to enable ART. */
			Cus_FLASH_ARTEnableFailed_Hook(acrReg);
			return;
		}

		if ( (acrReg & FLASH_ACR_PRFTEN_Msk) && (acrReg & FLASH_ACR_ICEN_Msk) && (acrReg & FLASH_ACR_DCEN_Msk) )
		{
			/* ART Accelerator has been Enabled. */
			return;
		}

		/* Enable Flash prefetch buffer and instruction cache (PRFTEN & ICEN & DCEN). */
		FLASH->ACR |= (FLASH_ACR_PRFTEN_Msk | FLASH_ACR_ICEN_Msk | FLASH_ACR_DCEN_Msk);
		__DSB();

		/* Check if the config has been written. */
		if ( !(FLASH->ACR & FLASH_ACR_PRFTEN_Msk) || !(FLASH->ACR & FLASH_ACR_ICEN_Msk) || !(FLASH->ACR & FLASH_ACR_DCEN_Msk) )
		{
			/* Something error happend? inform the upper layer. */
			Cus_FLASH_ARTEnableFailed_Hook(FLASH->ACR);
			return;
		}

