R6bandito/stm32_Cus_Flashdriver/Cus_Flash.c
	Cus_Flash_State_t 
	Cus_FlashMgr_DeleteByIndex( FlashMgr_Instance_t *instance, uint32_t recordIndex )
	{
		/* Check if the recordIndex valid. */
		if ( !instance || (recordIndex >= instance->mgrRecordCount) )
			return CUS_FLASH_PARAMETER;

		/* Ensure the instance is still valid (not deinitialized) before proceeding. */
		if ( !instance->mgrStartAddr || !instance->mgrEndAddr )
			return CUS_FLASH_PARAMETER;

		/* Change the validFlag in Flash for this record to invalid. */
		uint32_t controlBlockAddr = (instance->mgrRecords[recordIndex].msgStartAddr - sizeof(desc_t));
		uint32_t validFlagAddr_inFlash = controlBlockAddr + offsetof(desc_t, validFlag);
		uint16_t delFlag = 0xFFFEUL;	/* bit0 = 0. Invalid Record. */

		Cus_Flash_State_t hReturn = Cus_Flash_WriteBuffer(validFlagAddr_inFlash, (uint8_t *)&delFlag, sizeof(delFlag));
		if ( hReturn != CUS_FLASH_OK )
		{
			/* Flash write error. Return. */
			return hReturn;
		}

		/* Use the tail data filling the holes that cased by delete operating. */
		instance->mgrRecords[recordIndex] = instance->mgrRecords[instance->mgrRecordCount - 1];
		instance->mgrRecordCount--;

		return CUS_FLASH_OK;
	}



	Cus_Flash_State_t 
	Cus_FlashMgr_DeleteByDesc( FlashMgr_Instance_t *instance, const char *desc )
	{
		if ( !desc || !instance )
			return CUS_FLASH_PARAMETER;

		/* Ensure the instance is still valid (not deinitialized) before proceeding. */
		if ( !instance->mgrStartAddr || !instance->mgrEndAddr )
			return CUS_FLASH_PARAMETER;

		/* Get record via desc. */
		Cus_Flash_desc_t descOut = { 0 };
		if ( Cus_FlashMgr_GetRecordByDesc(instance, desc, &descOut) != CUS_FLASH_OK )
		{
			/* Not find the relavent record. Return. */
			return CUS_FLASH_NOT_FOUND;
		}

		/* Delete record via Index. */
		Cus_Flash_State_t hReturn = Cus_FlashMgr_DeleteByIndex(instance, descOut.dataIndexInPoll);

		return hReturn;
	}



	Cus_Flash_State_t 
	Cus_FlashMgr_GetRecordCount( FlashMgr_Instance_t *instance, uint16_t *pOut )
	{
		if ( !instance || !pOut )
			return CUS_FLASH_PARAMETER;

		*pOut = instance->mgrRecordCount;

		return CUS_FLASH_OK;
	}



	Cus_Flash_State_t 
	Cus_FlashMgr_GetFreeSpace( FlashMgr_Instance_t *instance, uint32_t *pOut )
	{
		if ( !instance || !pOut )
			return CUS_FLASH_PARAMETER;

		/* Ensure the instance is still valid (not deinitialized) before proceeding. */
		if ( !instance->mgrStartAddr || !instance->mgrEndAddr )
			return CUS_FLASH_PARAMETER;

		uint32_t Remain = (instance->mgrEndAddr - instance->mgrLowestFreeAddr);
		if ( Remain < sizeof(desc_t) )
		{
			/* Not enough space left for the next control head. */
			/* Return no free space left though there are some space hard to use. */
			*pOut = 0;
		}
		else 
		{
			/* Return the available user data size(excluding the control header). */
			*pOut = (Remain - sizeof(desc_t));
		}

		return CUS_FLASH_OK;
	}



	Cus_Flash_State_t 
	Cus_FlashMgr_EraseRegion( FlashMgr_Instance_t *instance )
	{
		if ( !instance )
			return CUS_FLASH_PARAMETER;

		/* Ensure the instance is still valid (not deinitialized) before proceeding. */
		if ( !instance->mgrStartAddr || !instance->mgrEndAddr )
			return CUS_FLASH_PARAMETER;

		#if (DEVICE_STM32F4xx)
			const Cus_Flash_Sector_t *Sector = Cus_Flash_GetSectorbyAddr(instance->mgrStartAddr);
			if ( !Sector )
			{
				/* Not found relavent sector. Return. */
				return CUS_FLASH_NOT_FOUND;
			}

			/* Erase the Manager-Controll sector. */
			Cus_Flash_State_t hReturn = Cus_Flash_EraseSector(Sector);
			if ( hReturn != CUS_FLASH_OK )
			{
				/* Erase failed! Return. */
				return hReturn;
			}
		#endif /* DEVICE_STM32F4xx */

		#if (DEVICE_STM32F1xx)
			int16_t startPage = Cus_Flash_GetPageIndex(instance->mgrStartAddr);
			int16_t endPage = Cus_Flash_GetPageIndex(instance->mgrEndAddr - 1);
			if ( (startPage < 0) || (endPage < 0) )
				return CUS_FLASH_ERROR;
			
			int16_t eraseCount = endPage - startPage + 1;
			if ( Cus_Flash_ErasePages(Cus_Flash_GetPageAddress(startPage), eraseCount) != eraseCount )
				return CUS_FLASH_ERROR;
		#endif /* DEVICE_STM32F1xx */

		/* Reset the states. */
		instance->mgrRecordCount = 0;
		instance->mgrLowestFreeAddr = instance->mgrStartAddr;

		return CUS_FLASH_OK;
	}



	Cus_Flash_State_t 
	Cus_FlashMgr_DeInit( FlashMgr_Instance_t *instance )
	{
		if ( !instance )
			return CUS_FLASH_PARAMETER;

		/* Traverse the manager table to find the index for this instance. */
		for( int16_t index = (int16_t)(gs_ActivateCount - 1); index >= 0; index-- )
		{
			if ( gs_ActivateMgr[index] == instance )
			{
				/* Find the relavent instance. Delete. */
				gs_ActivateMgr[index] = gs_ActivateMgr[(gs_ActivateCount - 1)];
				gs_ActivateCount--;

				/* Reset the states. */
				instance->mgrEndAddr = 0;
				instance->mgrLowestFreeAddr = 0;
				instance->mgrStartAddr = 0;

				return CUS_FLASH_OK;
			}
		}

		/* Not Found. Return. */
		return CUS_FLASH_NOT_FOUND;
	}



	Cus_Flash_State_t 
	Cus_FlashMgr_DeleteAllByDesc( FlashMgr_Instance_t *instance, const char *desc, uint16_t *delCnt )
	{
		if ( !instance || !instance->mgrStartAddr || !instance->mgrEndAddr || !desc )
			return CUS_FLASH_PARAMETER;

		uint16_t deleted = 0;
		Cus_Flash_desc_t Out;

		/* O(n^2) complexity, but acceptable since the record count is small. */
		while( Cus_FlashMgr_GetRecordByDesc(instance, desc, &Out) == CUS_FLASH_OK )
		{
			/* Relavent records still exist. Continue deletion.  */
			Cus_Flash_State_t hReturn = Cus_FlashMgr_DeleteByIndex(instance, Out.dataIndexInPoll);
			if ( hReturn != CUS_FLASH_OK )
			{
				/* Delete Err. Return. */
				return hReturn;
			}

			/* Successful delete this record. Continue. */
			deleted++;

			if ( delCnt )	*delCnt = deleted;
		}

		/* Has been deleted all relavent records. */
		return (deleted ? CUS_FLASH_OK : CUS_FLASH_NOT_FOUND);
	}



	Cus_Flash_State_t 
	Cus_FlashMgr_DumpByDesc( FlashMgr_Instance_t *instance, const char *desc, Cus_Flash_PrintCB pcallback )
	{
		if ( !instance || !pcallback || !desc )
			return CUS_FLASH_PARAMETER;

		/* Print the table header first. */
		pcallback("Idx Type   Size  FlashAddr      Desc");
		pcallback("-------------------------------------");

		uint16_t outPutMask[FLASH_MGR_MAX_RECORDS] = { 0 };
		char buffer[64] = { 0 };
		uint16_t total = 0;
		for( uint16_t i = 0; i < instance->mgrRecordCount; i++ )
		{
			uint32_t bestAddr = 0;
			uint32_t bestIdx = 0;
			bool found = false;

			for( uint16_t j = 0; j < instance->mgrRecordCount; j++ )
			{
				/* This entry has already been processed. Skip. */
				if ( outPutMask[j] )
					continue;

				/* Check if the desc not match. Continue. */
				if ( strncmp(desc, instance->mgrRecords[j].msgDetail, 16) != 0 )	
					continue;
				
				/* Find the record entry matching the Desc, and check if its address exceeds the current maximum. */
				if ( instance->mgrRecords[j].msgStartAddr > bestAddr )
				{
					bestAddr = instance->mgrRecords[j].msgStartAddr;
					bestIdx = j;
					found = true;
				}
			}

			total++;
			/* Has no matched records. Break.*/
			if ( !found )	break;

			/* Process this matched entries. */
			outPutMask[bestIdx] = 1;
			FlashMgr_Record_t *Record = &instance->mgrRecords[bestIdx];
			snprintf(buffer, sizeof(buffer), "%3u %4u %6lu 0x%08lX %-16s",
						total, Record->msgType, Record->msgSize, Record->msgStartAddr, Record->msgDetail);

			pcallback(buffer);
			memset(buffer, 0, sizeof(buffer));
		}

		/* Print the table tail. */
		pcallback("-------------------------------------");

		uint32_t freeBytes = 0;
		Cus_FlashMgr_GetFreeSpace(instance, &freeBytes);

		snprintf(buffer, sizeof(buffer), " Free: %lu bytes  |  Records: %u",
					(unsigned long)freeBytes, (unsigned int)total);
		pcallback(buffer);

		return CUS_FLASH_OK;
	}

#endif /* CUS_FLASH_USE_MANAGER */



